** A simple example
Then use the following example

#+begin_src matlab :results output latex :exports results  :eval never-export :wrap latex
x = [1, 2, 3, 4, 5];
fprintf('|%d', x)
#+end_src

#+RESULTS:
#+begin_latex
|1|2|3|4|5
#+end_latex


** A more advanced example 

#+begin_src matlab   :results output raw :exports results  :eval never-export 
al=1-0.99;
l=norminv(1-al/2,0,1);
n=53;
p0=15/53;
q0=1-15/53;
err=sqrt((p0*q0)/n);
ic=l*err;
disp('\begin{align*}')
fprintf('p_0&=\\frac{15}{53}=%g\\\\ \n',p0)
fprintf('\\lambda_p &=%g\\\\ \n',l)
fprintf('p_{0}&\\pm \\lambda_{1-\\frac{\\alpha }{2}}\\sqrt{\\frac{p_{0}(1-p_{0})}{n}}=% g \\pm %g\\cdot %g\\\\ \n',p0,l,err)
fprintf('p_{0}&\\pm \\lambda_{1-\\frac{\\alpha }{2}}\\sqrt{\\frac{p_{0}(1-p_{0})}{n}}=%g \\pm %g \n',p0,ic)
disp('\end{align*}')
#+end_src

#+RESULTS:
\begin{align*}
p_0&=\frac{15}{53}=0.283019\\
\lambda_p &=2.57583\\
p_{0}&\pm \lambda_{1-\frac{\alpha }{2}}\sqrt{\frac{p_{0}(1-p_{0})}{n}}= 0.283019 \pm 2.57583\cdot 0.0618762\\
p_{0}&\pm \lambda_{1-\frac{\alpha }{2}}\sqrt{\frac{p_{0}(1-p_{0})}{n}}=0.283019 \pm 0.159383
\end{align*}


# LocalWords:  notranslate usr sudo jupyter setuptools pexpect matlabkernel ipython dinojr eng setq
# LocalWords:  lang noweb hlines defalias
